app/controllers/blogs_controller.rb

  def show
    @blog = Blog.find(params[:id])#取得後インスタンス変数としてビューへ
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def index
    @blogs = Blog.all #取得したのをインスタンス変数としてビューへ
---
SELECT "blogs".* FROM "blogs"

  def edit
    @blog = Blog.find(params[:id])#投稿記事と同じく編集もデータ１件。BlogDBから探す
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def update
    blog = Blog.find(params[:id])
    blog.update(blog_params)
---
SELECT  "blogs".* FROM "blogs" WHERE "blogs"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]
UPDATE "blogs" SET "title" = ?, "category" = ?, "body" = ?, "updated_at" = ? WHERE "blogs"."id" = ?  [["title", "編集"], ["category", "編集"], ["body", "編集"], ["updated_at", "2019-04-11 02:53:28.196445"], ["id", 1]]